# ExportLinks Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
NavisworksExportOptions..::..ExportLinks Property
NavisworksExportOptions Class See Also
---
True to export Revit links found in the main model, false to skip links. Default value is false.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool ExportLinks { get; set; }
```

Visual Basic
---
```text
Public Property ExportLinks As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ExportLinks {
	bool get ();
	void set (bool value);
}
```

# See Also
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace